Dlubal.RFEM5.IFeMesh
Interface for working with FE mesh.

Dlubal.RFEM5.IFeMesh.GetNodes
Gets array of all FE mesh nodes.
Returns:  Array of FE mesh nodes.

Dlubal.RFEM5.IFeMesh.Get1DElements
Gets array of all 1D finite elements.
Returns:  Array of 1D finite elements.

Dlubal.RFEM5.IFeMesh.Get2DElements
Gets array of all 2D finite elements (cells).
Returns: Array of 2D finite elements (cells)

Dlubal.RFEM5.IFeMesh.Get3DElements
Gets array of all 3D finite elements (bricks).
Returns: Array of 3D finite elements (bricks)

Dlubal.RFEM5.IFeMesh.GetMemberNodes(System.Int32,System.UInt32)
Gets array of FE mesh nodes for a specified member.
Returns: Array of member's FE mesh nodes
No: Number or index of the member whose FE mesh nodes you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IFeMesh.GetMemberElements(System.Int32,System.UInt32)
Gets array of FE mesh 1D finite elements for a specified member.
Returns: Array of member's FE mesh 1D elements
No: Number or index of the member whose FE mesh 1D elements you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IFeMesh.GetSurfaceNodes(System.Int32,System.UInt32)
Gets array of FE mesh nodes for a specified surface.
Returns: Array of member's FE mesh 2D elements
No: Number or index of the surface whose FE mesh 2D elements you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IFeMesh.GetSurfaceElements(System.Int32,System.UInt32)
Gets array of FE mesh 2D finite elements (cells) for a specified surface.
Returns: Array of member's FE mesh 2D elements
No: Number or index of the surface whose FE mesh 2D elements you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IFeMesh.GetSolidNodes(System.Int32,System.UInt32)
Gets array of FE mesh nodes for a specified solid.
Returns: Array of member's FE mesh 3D elements
No: Number or index of the solid whose FE mesh 3D elements you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IFeMesh.GetSolidElements(System.Int32,System.UInt32)
Gets array of FE mesh 3D finite elements (bricks) for a specified solid.
Returns: Array of member's FE mesh 3D elements
No: Number or index of the solid whose FE mesh 3D elements you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IFeMesh.FindNodeNo(System.UInt32@)
Finds number of a FE mesh node with specified coordinates.
Returns: Number of the FE mesh node. If no FE mesh node is found returns zero.
Location: Coordinates of the FE mesh node you want to find.